Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotTemporaryDrawText_t
The Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotTemporaryDrawText_t struct maps to the TS native structure for text graphics.

Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotTemporaryDrawText_t.MaxTextLength
The maximum allowed number of characters composing the text.

Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotTemporaryDrawText_t.StartPoint
The start point of the segment along which to display the text.

Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotTemporaryDrawText_t.EndPoint
The end point of the segment along which to display the text.

Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotTemporaryDrawText_t.aText
The character array, size is Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotTemporaryDrawText_t.MaxTextLength + 1 because TS expects a null-terminated string.

Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotTemporaryDrawText_t.Color
The color of the text.

Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotTemporaryDrawText_t.BackgroundColor
The background color of the text.

Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotTemporaryDrawText_t.Id
The identifier of the text.

Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotTemporaryDrawText_t.SubId
The sub-identifier of the text, usually 0.

Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotTemporaryDrawText_t.ViewId
The view identifier.

Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotTemporaryDrawText_t.IsInteractive
A value indicating whether the text is interactive.